experiments/re_vs_cd/templates/openfoam/Allrun
#!/bin/sh
cd "${0%/*}" || exit
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions

runApplication blockMesh
runApplication snappyHexMesh -overwrite
restore0Dir
runApplication potentialFoam -writephi
runApplication checkMesh
runApplication $(getApplication)
